---
type: RebarShapeConstraint180DegreeBendRadius
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraint180DegreeBendRadius

`Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraint180DegreeBendRadius | 2012 | `public RebarShapeConstraint180DegreeBendRadius ( ElementId paramId , RebarShapeArcReferenceType refType )` |
| Property | ArcReferenceType | 2012 | `public RebarShapeArcReferenceType ArcReferenceType { get ; }` |